music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "9XZADkXdz7A74XXgWmZDUw"], ["id", 4]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!