music_app/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token]) #optimized to not query db again if current_user exists
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "9XZADkXdz7A74XXgWmZDUw"], ["LIMIT", 1]]