music_app/app/controllers/bands_controller.rb

    def update
        @band = Band.find_by(id: params[:id])

        if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "NOT Joanna Newsom"], ["updated_at", "2019-02-28 22:00:18.038698"], ["id", 1]]

    def destroy
        @band = Band.find_by(id: params[:id])

        @band.delete if @band
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]